app/controllers/api/v1/guests_controller.rb

  def create
    guest = Guest.new(guest_params)

    if guest.save
---
INSERT INTO "guests" ("full_name", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["full_name", "John Doe"], ["phone_number", "1234567890"], ["created_at", "2023-04-14 21:23:37.324590"], ["updated_at", "2023-04-14 21:23:37.324590"]]